; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v5)
		(pred_3 ?v2)
		(pred_2 ?v8)
		(pred_4 ?v8)
		(pred_1 ?v2 ?v8)
		(pred_6)
		(pred_5 ?v2))

   (:action op_2
       :parameters  (?v6 ?v3)
       :precondition (and (not-eq ?v6 ?v3) 
                          (pred_2 ?v6) (pred_2 ?v3) (pred_4 ?v6))
       :effect (and  (pred_4 ?v3)
		     (not (pred_4 ?v6))))


   (:action op_3
       :parameters (?v7 ?v1)
       :precondition  (and  (pred_3 ?v7) (pred_2 ?v1)
			    (pred_1 ?v7 ?v1) (pred_4 ?v1) (pred_6))
       :effect (and (pred_5 ?v7)
		    (not (pred_1 ?v7 ?v1)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v7  ?v1)
       :precondition  (and  (pred_3 ?v7) (pred_2 ?v1)
			    (pred_5 ?v7) (pred_4 ?v1))
       :effect (and (pred_1 ?v7 ?v1)
		    (pred_6)
		    (not (pred_5 ?v7)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_01 obj_03 obj_05 
          obj_02 obj_04 
)
(:init
(pred_2 obj_01)
(pred_2 obj_03)
(pred_2 obj_05)
(pred_3 obj_02)
(pred_3 obj_04)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(pred_6)
(pred_1 obj_02 obj_01)
(pred_1 obj_04 obj_03)
(pred_4 obj_03)
)
(:goal
(and
(pred_1 obj_02 obj_05)
(pred_1 obj_04 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_02 obj_05) (pred_4 obj_03))
    (sometime-before  (pred_1 obj_04 obj_01) (pred_4 obj_05))
  )
)
)

; plan
1. (op_2 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_01)
   goals met: 0 of 2
2. (op_3 obj_02 obj_01)
   deleted: (pred_1 obj_02 obj_01) (pred_6)
   added: (pred_5 obj_02)
   goals met: 0 of 2
3. (op_2 obj_01 obj_05)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_05)
   goals met: 0 of 2
4. (op_1 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_1 obj_02 obj_05) (pred_6)
   goals met: 1 of 2
5. (op_2 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_03)
   goals met: 1 of 2
6. (op_3 obj_04 obj_03)
   deleted: (pred_1 obj_04 obj_03) (pred_6)
   added: (pred_5 obj_04)
   goals met: 1 of 2
7. (op_2 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_01)
   goals met: 1 of 2
8. (op_1 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_1 obj_04 obj_01) (pred_6)
   goals met: 2 of 2
